# здесь должно быть описание класса View или ActiveView смысл работы каторого заключается в том, чтобы автоматизировать обработку рендеринга. Этот класс должен принимать данные, вычислять по этим данным какой темплейт заиспользовать, и рендерить этот темплейт. После чего результат он должен отдать контроллеру (который вернет результат в браузер)
# Однако на серверной стороне мы пока не занимается рендерингом.
# А также надо тогда решить вопрос - что мы делаем с компонентами - зачем они нужны тогда как классы?
